In [1]:
import os
import mysql.connector as connector
import logging

In [2]:
logger = logging.getLogger("[Views MySQL]")
if os.path.exists("../log/views-mysql.log"):
  os.remove("../log/views-mysql.log")
logging.basicConfig(filename='../log/views-mysql.log', encoding='utf-8', level=logging.DEBUG, format='%(asctime)s ==> %(message)s', datefmt='%m/%d/%Y %I:%M:%S')

In [3]:
logger.info("Creating a connection between MySQL and Python")
dbconfig={"user":"root", "password":os.environ["MYSQL_PASSWORD"], "port":33061, "host":"localhost"}
connection=connector.connect(**dbconfig)
print("Connection established between MySQL and Python")
logger.info("Connection established between MySQL and Python")

Connection established between MySQL and Python

In [4]:
print("Creating cursor object from connection")
logger.info("Creating first cursor object from connection")
cursor = connection.cursor()
print("Cursor object created to communicate with MySQL using Python.")
logger.info("Cursor object created to communicate with MySQL using Python.")

Creating cursor object from connection
Cursor object created to communicate with MySQL using Python.

In [5]:
# Get a cursor object from the cursor pool
database_name: str = "db_views"
drop_database_query: str = f"""DROP DATABASE IF EXISTS {database_name}"""
cursor.execute(drop_database_query)
logger.info("Dropping Database if it already exists.")

create_database_query: str = f"""CREATE DATABASE IF NOT EXISTS {database_name}"""
print("Creating Database.")
logger.info("Creating Database.")
cursor.execute(create_database_query)
logger.info("Database created.")
print("Database created.")

Creating Database.
Database created.

In [6]:
# Check to see that the database was created
list_of_databases: list = []
cursor.execute("SHOW DATABASES;")
databases = cursor.fetchall()
for database in databases:
    db_name: str = database[0]
    list_of_databases.append(db_name)
    if db_name == database_name:
        print(f"Database '{database_name}' was successfully created")
        logger.info(f"Database '{database_name}' was successfully created.")
        break

# Set the new created database as the database to use
cursor.execute(f"USE {database_name}")
print(f"Database '{database_name}' set for use.")
logger.info(f"Database '{database_name}' set for use.")

Database 'db_views' was successfully created
Database 'db_views' set for use.

In [7]:
create_orders_query = """CREATE TABLE IF NOT EXISTS tbl_orders (OrderID INT NOT NULL PRIMARY KEY, ProductID INT, CustomerID INT, SalesPersonID INT, OrderDate Date, ShipDate DATE, OrderStatus VARCHAR(50), ShipAddress VARCHAR(255), BillAddress VARCHAR(255), 
Quantity INT, Sales INT, CreationTime TimeStamp);"""
cursor.execute(create_orders_query)
logger.info("tbl_orders table created.")

create_products_query = """CREATE TABLE IF NOT EXISTS tbl_products (ProductID INT NOT NULL PRIMARY KEY, Product VARCHAR(50), Category VARCHAR(50), Price INT);"""
cursor.execute(create_products_query)
logger.info("tbl_products table created.")

create_customers_query = """CREATE TABLE IF NOT EXISTS tbl_customers (CustomerID INT NOT NULL PRIMARY KEY, FirstName VARCHAR(50), LastName VARCHAR(50), Country VARCHAR(50), Score INT);"""
cursor.execute(create_customers_query)
logger.info("tbl_customers table created.")

create_employees_query = """CREATE TABLE IF NOT EXISTS tbl_employees (EmployeeID INT NOT NULL PRIMARY KEY, FirstName VARCHAR(50), LastName VARCHAR(50), Department VARCHAR(50), BirthDate Date, Gender CHAR(1), Salary INT, ManagerID INT);"""
cursor.execute(create_employees_query)
logger.info("tbl_employees table created.")

In [8]:
insert_into_orders_query = """INSERT INTO tbl_orders(OrderID, ProductID, CustomerID, SalesPersonID, OrderDate, ShipDate, OrderStatus, ShipAddress, BillAddress, Quantity, Sales, CreationTime) VALUES
(1, 101, 2, 3, '2025-01-01', '2025-01-05', 'Delivered', '9833 Mt. Dias Blv.', '1226 Shoe St.', 1, 10, '2025-01-01 12:34:56.0000000'),  
(2, 102, 3,	3, '2025-01-05', '2025-01-10', 'Shipped', '250 Race Court', NULL, 1, 15, '2025-01-05 23:22:04.0000000'),
(3, 101, 1,	5, '2025-01-10', '2025-01-25', 'Delivered', '8157 W. Book', '8157 W. Book', 2, 20, '2025-01-10 18:24:08.0000000'),
(4, 105, 1, 3, '2025-01-20', '2025-01-25', 'Shipped', '5724 Victory Lane', '',	2, 60, '2025-01-20 05:50:33.0000000'),
(5, 104, 2, 5, '2025-02-01', '2025-02-05', 'Delivered', NULL , NULL , 1, 25, '2025-02-01 14:02:41.0000000'),
(6, 104, 3, 5, '2025-02-05', '2025-02-10', 'Delivered', '1792 Belmont Rd.',NULL , 2, 50, '2025-02-06 15:34:57.0000000'),
(7, 102, 1, 1, '2025-02-15', '2025-02-27', 'Delivered', '136 Balboa Court', '' , 2, 30, '2025-02-16 06:22:01.0000000'),
(8, 101, 4, 3, '2025-02-18', '2025-02-27', 'Shipped', '2947 Vine Lane', '4311 Clay Rd', 3, 90, '2025-02-18 10:45:22.0000000'),
(9, 101, 2, 3, '2025-03-10', '2025-03-15', 'Shipped', '3768 Door Way', '', 2, 20, '2025-03-10 12:59:04.0000000'),
(10, 102, 3, 5, '2025-03-15', '2025-03-20', 'Shipped', NULL , NULL, 0, 60, '2025-03-16 23:25:15.0000000');"""

cursor.execute(insert_into_orders_query)
connection.commit()

insert_into_products_query = """INSERT INTO tbl_products(ProductID, Product, Category, Price) VALUES
(101, 'Bottle', 'Accessories', 10),  
(102, 'Tire', 'Accessories', 15),
(103, 'Socks', 'Clothing', 20),  
(104, 'Caps', 'Clothing', 25),
(105, 'Gloves', 'Clothing', 30);"""

value = None

cursor.execute(insert_into_products_query)
connection.commit()


insert_into_customers_query = """INSERT INTO tbl_customers(CustomerID, FirstName, LastName, Country, Score) VALUES
(1, 'Jossef', 'Goldberg', 'Germany', 350),
(2, 'Kevin', 'Brown', 'USA', 900),
(3, 'Mary', NULL, 'USA', 750),
(4, 'Mark', 'Schwarz', 'Germany', 500),
(5, 'Anna', 'Adams', 'USA', NULL);"""

cursor.execute(insert_into_customers_query)
connection.commit()

insert_into_employees_query = """INSERT INTO tbl_employees(EmployeeID, FirstName, LastName, Department, BirthDate, Gender, Salary, ManagerID) VALUES
(1, 'Frank', 'Lee', 'Marketing', '1988-12-05', 'M', 55000, NULL),
(2, 'Kevin', 'Brown', 'Marketing', '1972-11-25', 'M', 65000, 1),
(3, 'Mary', NULL, 'Sales', '1986-01-05', 'F', 75000, 1), 
(4, 'Michael', 'Ray', 'Sales', '1977-02-10', 'M', 90000, 2), 
(5, 'Carol', 'Baker', 'Sales', '1982-02-11', 'F', 55000, 3);"""

cursor.execute(insert_into_employees_query)
connection.commit()

## Function to display results in a table format (like the command line)

In [9]:
def select_all_query(table_name: str):
    query = f"""SELECT * FROM {table_name};"""
    return query


def display_results(table_column_names: list, results: list):
    table_columns_length = [len(x) for x in table_column_names]
    for result in results:
        for value in range(len(result)):
            row_data = result[value]
            if row_data:
                row_data = str(row_data)
                if len(row_data) > table_columns_length[value]:
                    table_columns_length[value] = len(row_data)
    dashes_plus = ""
    for num in range(len(table_columns_length)):
        dashes_plus = dashes_plus + "+" + '-'*(table_columns_length[num]+2)
    dashes_plus = dashes_plus + "+"
    
    print(dashes_plus)
    
    table_headers = ""
    for num in range(len(table_column_names)):
        table_headers = table_headers + f"| {table_column_names[num]:^{table_columns_length[num]}} "
    table_headers = table_headers + "|"
    print(table_headers)
    
    print(dashes_plus)
    
    for result in results:
        table_row = ""
        for value in range(len(result)):
            row_data = result[value]
            if row_data is None:
                row_data = "NULL"            
                #if "Field" in table_column_names or "select_type" in table_column_names:
                    #row_data = None
                #else:
                    #row_data = None
            table_row = table_row + "|" + f"{str(row_data):^{table_columns_length[value]+2}}"
        print(table_row + "|")
    print(dashes_plus)
    print(f"{len(results)} rows returned")

def execute_display_query_results(query: str = "", table_column_names: list = [], results: list = []): 
    if query:
        logger.info(f"Executing the query: {query}")
    if len(query) > 2 and (table_column_names or results):
        print("You can only pass in the query alone or the table_column_names and results list")
        assert False
    if query and not table_column_names and not results:
        cursor.execute(query)
        results = cursor.fetchall()    
        table_column_names = cursor.column_names
    
    display_results(table_column_names, results)

In [10]:
execute_display_query_results(select_all_query("tbl_orders"))
print("\n")
execute_display_query_results(select_all_query("tbl_products"))
print("\n")
execute_display_query_results(select_all_query("tbl_customers"))

+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |    8157 W. Book    | 8157 W. Book  |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane  |               |    2     |  60   | 2025-01-20 05:50:33 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  |  136 Balboa Court  |               |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |   2947 Vine Lane   | 4311 Clay Rd  |    3     |  90   | 2025-02-18 10:45:22 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
10 rows returned


+-----------+---------+-------------+-------+
| ProductID | Product |  Category   | Price |
+-----------+---------+-------------+-------+
|    101    | Bottle  | Accessories |  10   |
|    102    |  Tire   | Accessories |  15   |
|    103    |  Socks  |  Clothing   |  20   |
|    104    |  Caps   |  Clothing   |  25   |
|    105    | Gloves  |  Clothing   |  30   |
+-----------+---------+-------------+-------+
5 rows returned


+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned

# Database Server
This stores, manages, and provides access to databases for users or applications

## Table
This a place where data is stored and organized into rows and columns

## Views 
This is a virtual table that shows data without storing it physically. It is based on the result set of a query. Views are persisted SQL queries in the database
They are used to store central, complex query logic in the database for access by multiple queries, reducing project complexity

## DDL - Data Definition Language
A set of commands that allows us to define and manage the structure of a database. **CREATE**, **ALTER**, **DROP**

## Physical Level
Lowest level. This stores Data Files, Partitions, Logs, Catalog, Blocks, Caches

# Views

## Task 1
Find the running total of sales for each month

In [19]:
select_query = """SELECT DATE_FORMAT(OrderDate, '%Y-%m-01') AS OrderMonth, 
SUM(Sales) AS TotalSales,
COUNT(OrderID) AS TotalOrders,
SUM(Quantity) AS TotalQuantity
FROM tbl_orders
GROUP BY DATE_FORMAT(OrderDate, '%Y-%m-01')
"""
execute_display_query_results(select_query)

+------------+------------+-------------+---------------+
| OrderMonth | TotalSales | TotalOrders | TotalQuantity |
+------------+------------+-------------+---------------+
| 2025-01-01 |    105     |      4      |       6       |
| 2025-02-01 |    195     |      4      |       8       |
| 2025-03-01 |     80     |      2      |       2       |
+------------+------------+-------------+---------------+
3 rows returned

In [15]:
select_query = """WITH CTE_Monthly_Summary AS (SELECT DATE_FORMAT(OrderDate, '%Y-%m-01') AS OrderMonth, SUM(Sales) AS TotalSales
FROM tbl_orders
GROUP BY DATE_FORMAT(OrderDate, '%Y-%m-01'))

SELECT OrderMonth, TotalSales,
SUM(TotalSales) OVER (ORDER BY OrderMonth) AS RunningTotal
FROM CTE_Monthly_Summary
"""
execute_display_query_results(select_query)

+------------+------------+--------------+
| OrderMonth | TotalSales | RunningTotal |
+------------+------------+--------------+
| 2025-01-01 |    105     |     105      |
| 2025-02-01 |    195     |     300      |
| 2025-03-01 |     80     |     380      |
+------------+------------+--------------+
3 rows returned

In [20]:
create_view_query = """CREATE VIEW Monthly_Summary AS 
(SELECT DATE_FORMAT(OrderDate, '%Y-%m-01') AS OrderMonth, SUM(Sales) AS TotalSales
FROM tbl_orders
GROUP BY DATE_FORMAT(OrderDate, '%Y-%m-01'))
"""
cursor.execute(create_view_query)

In [21]:
execute_display_query_results("SELECT * FROM Monthly_Summary")

+------------+------------+
| OrderMonth | TotalSales |
+------------+------------+
| 2025-01-01 |    105     |
| 2025-02-01 |    195     |
| 2025-03-01 |     80     |
+------------+------------+
3 rows returned

In [22]:
select_query = """SELECT OrderMonth, TotalSales,
SUM(TotalSales) OVER (ORDER BY OrderMonth) AS RunningTotal
FROM Monthly_Summary
"""
execute_display_query_results(select_query)

+------------+------------+--------------+
| OrderMonth | TotalSales | RunningTotal |
+------------+------------+--------------+
| 2025-01-01 |    105     |     105      |
| 2025-02-01 |    195     |     300      |
| 2025-03-01 |     80     |     380      |
+------------+------------+--------------+
3 rows returned

## Alter View

In [25]:
create_view_query = """ALTER ALGORITHM=MERGE VIEW Monthly_Summary AS 
(SELECT DATE_FORMAT(OrderDate, '%Y-%m-01') AS OrderMonth, 
SUM(Sales) AS TotalSales,
SUM(Quantity) AS TotalQuantity
FROM tbl_orders
GROUP BY DATE_FORMAT(OrderDate, '%Y-%m-01'))
"""
cursor.execute(create_view_query)

In [29]:
select_query = """SELECT *, SUM(TotalSales) OVER () AS RunningTotal
FROM Monthly_Summary
"""
execute_display_query_results(select_query)

+------------+------------+---------------+--------------+
| OrderMonth | TotalSales | TotalQuantity | RunningTotal |
+------------+------------+---------------+--------------+
| 2025-01-01 |    105     |       6       |     380      |
| 2025-02-01 |    195     |       8       |     380      |
| 2025-03-01 |     80     |       2       |     380      |
+------------+------------+---------------+--------------+
3 rows returned

In [30]:
select_query = """SELECT *, SUM(TotalSales) OVER (ORDER BY OrderMonth) AS RunningTotal
FROM Monthly_Summary
"""
execute_display_query_results(select_query)

+------------+------------+---------------+--------------+
| OrderMonth | TotalSales | TotalQuantity | RunningTotal |
+------------+------------+---------------+--------------+
| 2025-01-01 |    105     |       6       |     105      |
| 2025-02-01 |    195     |       8       |     300      |
| 2025-03-01 |     80     |       2       |     380      |
+------------+------------+---------------+--------------+
3 rows returned

In [31]:
create_view_query = """CREATE OR REPLACE VIEW Monthly_Summary AS 
(SELECT DATE_FORMAT(OrderDate, '%Y-%m-01') AS OrderMonth, 
SUM(Sales) AS TotalSales,
SUM(Quantity) AS TotalSalesQuantity
FROM tbl_orders
GROUP BY DATE_FORMAT(OrderDate, '%Y-%m-01'))
"""
cursor.execute(create_view_query)

In [32]:
select_query = """SELECT *, SUM(TotalSales) OVER (ORDER BY OrderMonth) AS RunningTotal
FROM Monthly_Summary
"""
execute_display_query_results(select_query)

+------------+------------+--------------------+--------------+
| OrderMonth | TotalSales | TotalSalesQuantity | RunningTotal |
+------------+------------+--------------------+--------------+
| 2025-01-01 |    105     |         6          |     105      |
| 2025-02-01 |    195     |         8          |     300      |
| 2025-03-01 |     80     |         2          |     380      |
+------------+------------+--------------------+--------------+
3 rows returned

## Views Use Case
- Views can be used to hide the complexity of database tables and offers users more friendly and easy-to-consume objects.
- Use views to enforce security and protect sensitive data, by hiding columns and/or rows from tables

## Task 2
Provide a view that combines details from orders, products, customers, and employees.

In [51]:
# COALESCE() Function: Return the first non-null value in a list:
#-- CONCAT(COALESCE(e.FirstName, ''), ' ', COALESCE(e.LastName, '')) AS EmployeeName,
select_query = """SELECT OrderID, OrderDate, Sales, Quantity, Product, Category, Price, 
CONCAT(COALESCE(c.FirstName, ''), ' ', COALESCE(c.LastName, '')) AS CustomerName,
CONCAT(COALESCE(e.FirstName, ''), ' ', COALESCE(e.LastName, '')) AS EmployeeName,
Department
FROM tbl_orders o
LEFT JOIN tbl_products USING(ProductID)
LEFT JOIN tbl_customers c USING(CustomerID)
LEFT JOIN tbl_employees e ON e.EmployeeID = o.SalesPersonID
"""
execute_display_query_results(select_query)

+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
| OrderID | OrderDate  | Sales | Quantity | Product |  Category   | Price |  CustomerName   | EmployeeName | Department |
+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
|    1    | 2025-01-01 |  10   |    1     | Bottle  | Accessories |  10   |   Kevin Brown   |    Mary      |   Sales    |
|    2    | 2025-01-05 |  15   |    1     |  Tire   | Accessories |  15   |      Mary       |    Mary      |   Sales    |
|    3    | 2025-01-10 |  20   |    2     | Bottle  | Accessories |  10   | Jossef Goldberg | Carol Baker  |   Sales    |
|    4    | 2025-01-20 |  60   |    2     | Gloves  |  Clothing   |  30   | Jossef Goldberg |    Mary      |   Sales    |
|    5    | 2025-02-01 |  25   |    1     |  Caps   |  Clothing   |  25   |   Kevin Brown   | Carol Baker  |   Sales    |
|    6    | 2025-02-05 |  50   |    2     |  Caps   |  Clothing   |  25   |      Mary       | Carol Baker  |   Sales    |
|    7    | 2025-02-15 |  30   |    2     |  Tire   | Accessories |  15   | Jossef Goldberg |  Frank Lee   | Marketing  |
|    8    | 2025-02-18 |  90   |    3     | Bottle  | Accessories |  10   |  Mark Schwarz   |    Mary      |   Sales    |
|    9    | 2025-03-10 |  20   |    2     | Bottle  | Accessories |  10   |   Kevin Brown   |    Mary      |   Sales    |
|   10    | 2025-03-15 |  60   |    0     |  Tire   | Accessories |  15   |      Mary       | Carol Baker  |   Sales    |
+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
10 rows returned

In [54]:
create_view_query = """CREATE OR REPLACE VIEW View_OrderDetails AS (SELECT OrderID, OrderDate, Sales, Quantity, Product, Category, Price, 
CONCAT(COALESCE(c.FirstName, ''), ' ', COALESCE(c.LastName, '')) AS CustomerName,
CONCAT(COALESCE(e.FirstName, ''), ' ', COALESCE(e.LastName, '')) AS EmployeeName,
Department
FROM tbl_orders o
LEFT JOIN tbl_products USING(ProductID)
LEFT JOIN tbl_customers c USING(CustomerID)
LEFT JOIN tbl_employees e ON e.EmployeeID = o.SalesPersonID);
"""
cursor.execute(create_view_query)

In [55]:
select_query = """SELECT * FROM View_OrderDetails
"""
execute_display_query_results(select_query)

+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
| OrderID | OrderDate  | Sales | Quantity | Product |  Category   | Price |  CustomerName   | EmployeeName | Department |
+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
|    1    | 2025-01-01 |  10   |    1     | Bottle  | Accessories |  10   |   Kevin Brown   |    Mary      |   Sales    |
|    2    | 2025-01-05 |  15   |    1     |  Tire   | Accessories |  15   |      Mary       |    Mary      |   Sales    |
|    3    | 2025-01-10 |  20   |    2     | Bottle  | Accessories |  10   | Jossef Goldberg | Carol Baker  |   Sales    |
|    4    | 2025-01-20 |  60   |    2     | Gloves  |  Clothing   |  30   | Jossef Goldberg |    Mary      |   Sales    |
|    5    | 2025-02-01 |  25   |    1     |  Caps   |  Clothing   |  25   |   Kevin Brown   | Carol Baker  |   Sales    |
|    6    | 2025-02-05 |  50   |    2     |  Caps   |  Clothing   |  25   |      Mary       | Carol Baker  |   Sales    |
|    7    | 2025-02-15 |  30   |    2     |  Tire   | Accessories |  15   | Jossef Goldberg |  Frank Lee   | Marketing  |
|    8    | 2025-02-18 |  90   |    3     | Bottle  | Accessories |  10   |  Mark Schwarz   |    Mary      |   Sales    |
|    9    | 2025-03-10 |  20   |    2     | Bottle  | Accessories |  10   |   Kevin Brown   |    Mary      |   Sales    |
|   10    | 2025-03-15 |  60   |    0     |  Tire   | Accessories |  15   |      Mary       | Carol Baker  |   Sales    |
+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
10 rows returned

## Task 3
Provide a view for the EU Sales Team that combines details from all tables and excludes data related to the USA.

In [56]:
select_query = """SELECT * FROM tbl_customers;"""
execute_display_query_results(select_query)

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned

In [60]:
create_view_query = """CREATE OR REPLACE VIEW View_EU_OrderDetails AS (SELECT OrderID, OrderDate, Sales, Quantity, Product, Category, Price, 
CONCAT(COALESCE(c.FirstName, ''), ' ', COALESCE(c.LastName, '')) AS CustomerName,
CONCAT(COALESCE(e.FirstName, ''), ' ', COALESCE(e.LastName, '')) AS EmployeeName,
Department
FROM tbl_orders o
LEFT JOIN tbl_products USING(ProductID)
LEFT JOIN tbl_customers c USING(CustomerID)
LEFT JOIN tbl_employees e ON e.EmployeeID = o.SalesPersonID
WHERE c.Country != 'USA');
"""
cursor.execute(create_view_query)

In [61]:
select_query = """SELECT * FROM View_EU_OrderDetails
"""
execute_display_query_results(select_query)

+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
| OrderID | OrderDate  | Sales | Quantity | Product |  Category   | Price |  CustomerName   | EmployeeName | Department |
+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
|    3    | 2025-01-10 |  20   |    2     | Bottle  | Accessories |  10   | Jossef Goldberg | Carol Baker  |   Sales    |
|    4    | 2025-01-20 |  60   |    2     | Gloves  |  Clothing   |  30   | Jossef Goldberg |    Mary      |   Sales    |
|    7    | 2025-02-15 |  30   |    2     |  Tire   | Accessories |  15   | Jossef Goldberg |  Frank Lee   | Marketing  |
|    8    | 2025-02-18 |  90   |    3     | Bottle  | Accessories |  10   |  Mark Schwarz   |    Mary      |   Sales    |
+---------+------------+-------+----------+---------+-------------+-------+-----------------+--------------+------------+
4 rows returned

In [63]:
create_view_query = """CREATE OR REPLACE VIEW View_Germany_OrderDetails AS (SELECT OrderID AS BestellNr, OrderDate AS Bestelldatum, Sales AS Umstaz, Quantity AS Menge, Product AS Produkt, Category AS Kategorie, Price AS Kosten, 
CONCAT(COALESCE(c.FirstName, ''), ' ', COALESCE(c.LastName, '')) AS KundenName,
CONCAT(COALESCE(e.FirstName, ''), ' ', COALESCE(e.LastName, '')) AS MitarbeiterName,
Department AS Abteilung
FROM tbl_orders o
LEFT JOIN tbl_products USING(ProductID)
LEFT JOIN tbl_customers c USING(CustomerID)
LEFT JOIN tbl_employees e ON e.EmployeeID = o.SalesPersonID
WHERE c.Country = 'Germany');
"""
cursor.execute(create_view_query)

In [64]:
select_query = """SELECT * FROM View_Germany_OrderDetails
"""
execute_display_query_results(select_query)

+-----------+--------------+--------+-------+---------+-------------+--------+-----------------+-----------------+-----------+
| BestellNr | Bestelldatum | Umstaz | Menge | Produkt |  Kategorie  | Kosten |   KundenName    | MitarbeiterName | Abteilung |
+-----------+--------------+--------+-------+---------+-------------+--------+-----------------+-----------------+-----------+
|     3     |  2025-01-10  |   20   |   2   | Bottle  | Accessories |   10   | Jossef Goldberg |   Carol Baker   |   Sales   |
|     4     |  2025-01-20  |   60   |   2   | Gloves  |  Clothing   |   30   | Jossef Goldberg |      Mary       |   Sales   |
|     7     |  2025-02-15  |   30   |   2   |  Tire   | Accessories |   15   | Jossef Goldberg |    Frank Lee    | Marketing |
|     8     |  2025-02-18  |   90   |   3   | Bottle  | Accessories |   10   |  Mark Schwarz   |      Mary       |   Sales   |
+-----------+--------------+--------+-------+---------+-------------+--------+-----------------+-----------------+-----------+
4 rows returned

In [66]:
select_query = "SELECT * FROM db_Exercise.Bookings;"
execute_display_query_results(select_query)

+-----------+---------+----------------+---------------+-------------+------------+
| BookingID | TableNo | GuestFirstName | GuestLastName | BookingSlot | EmployeeID |
+-----------+---------+----------------+---------------+-------------+------------+
|     1     |   12    |      Anna      |    Iversen    |  19:00:00   |     1      |
|     2     |   12    |     Joakim     |    Iversen    |  19:00:00   |     1      |
|     3     |   19    |    Vanessa     |   McCarthy    |  15:00:00   |     3      |
|     4     |   15    |     Marcos     |    Romero     |  17:30:00   |     4      |
|     5     |    5    |     Hiroki     |    Yamane     |  18:30:00   |     2      |
|     6     |    8    |     Diana      |     Pinto     |  20:00:00   |     5      |
+-----------+---------+----------------+---------------+-------------+------------+
6 rows returned

In [67]:
select_query = "SHOW TABLES FROM db_Exercise;"
execute_display_query_results(select_query)

+-----------------------+
| Tables_in_db_Exercise |
+-----------------------+
|       Bookings        |
|       Customers       |
|      FoodOrders       |
|   LowCostMenuItems    |
|       MenuItems       |
|         Menus         |
|         Staff         |
|      TableOrders      |
+-----------------------+
8 rows returned

In [68]:
select_query = "SHOW databases;"
execute_display_query_results(select_query)

+------------------------+
|        Database        |
+------------------------+
|          CVD           |
|     LittleLemonDB      |
|           PC           |
|    STAFF_LOCATIONS     |
|     classicmodels      |
|      db_Exercise       |
|         db_hr          |
|       db_learner       |
|    db_little_lemon     |
|        db_meta         |
| db_meta_advanced_mysql |
|   db_meta_dsm_mysql    |
|     db_mysqladmin      |
|     db_subqueries      |
|        db_views        |
|        db_world        |
|   global_super_store   |
|   information_schema   |
|      little_lemon      |
|    little_lemon_db     |
|      lucky_Shrub       |
|     mangata_gallo      |
|     mangata_jw_db      |
|        meta_db         |
|       mg_schema        |
|         mysql          |
|   performance_schema   |
|         sakila         |
|          sys           |
+------------------------+
29 rows returned